In [1]:
import numpy as np
import pandas as pd

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0]= None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  0.897690       NaN -1.277665
3 -0.339891       NaN  0.420248
4  0.572636 -2.835838 -0.099543
5 -0.113587  0.085833  0.488296
6 -0.584865 -1.094547 -0.189622

In [14]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
df.dropna()
df.dropna(thresh=2)

          0         1         2
2  1.366849       NaN -0.780610
3 -0.128218       NaN -0.290770
4  0.215468  1.135632 -0.934618
5 -0.015510 -0.732633 -0.440658
6  0.924769  0.687133  0.527479

In [15]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.132738  0.500000  0.000000
1 -1.345195  0.500000  0.000000
2  1.366849  0.500000 -0.780610
3 -0.128218  0.500000 -0.290770
4  0.215468  1.135632 -0.934618
5 -0.015510 -0.732633 -0.440658
6  0.924769  0.687133  0.527479

In [16]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  0.132738  0.000000  0.000000
1 -1.345195  0.000000  0.000000
2  1.366849  0.000000 -0.780610
3 -0.128218  0.000000 -0.290770
4  0.215468  1.135632 -0.934618
5 -0.015510 -0.732633 -0.440658
6  0.924769  0.687133  0.527479

In [17]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.040471  0.406479  0.414251
1 -0.084260 -1.255526  1.403240
2  3.318601 -1.255526 -0.470582
3  0.068791 -1.255526 -0.211905
4 -1.030452       NaN -0.211905
5 -1.327691       NaN -0.211905

In [18]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [19]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [23]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [24]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [25]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [26]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [27]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [28]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [29]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [30]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [31]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [32]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [33]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [34]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [35]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [36]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [37]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [38]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [39]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [40]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [41]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [42]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.66, 0.88], (0.24, 0.45], (0.66, 0.88], (0.45, 0.66], (0.24, 0.45], ..., (0.24, 0.45], (0.66, 0.88], (0.033, 0.24], (0.24, 0.45], (0.45, 0.66]]
Length: 20
Categories (4, interval[float64]): [(0.033, 0.24] < (0.24, 0.45] < (0.45, 0.66] < (0.66, 0.88]]

In [43]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(0.676, 2.764]       250
(0.00202, 0.676]     250
(-0.649, 0.00202]    250
(-3.206, -0.649]     250
dtype: int64

In [44]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.00202, 1.283], (-1.251, 0.00202], (-1.251, 0.00202], (1.283, 2.764], (1.283, 2.764], ..., (0.00202, 1.283], (0.00202, 1.283], (0.00202, 1.283], (-1.251, 0.00202], (-1.251, 0.00202]]
Length: 1000
Categories (4, interval[float64]): [(-3.206, -1.251] < (-1.251, 0.00202] < (0.00202, 1.283] <
                                    (1.283, 2.764]]

In [45]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.011216    -0.002853    -0.027450    -0.076897
std       0.968960     0.979562     0.983335     0.997400
min      -2.964456    -2.870278    -3.259759    -3.008480
25%      -0.686696    -0.690528    -0.617242    -0.741641
50%      -0.000011    -0.042040    -0.037898    -0.042878
75%       0.650469     0.660259     0.614981     0.589848
max       3.265581     3.451387     2.724269     3.740591

In [46]:
col = data[2]
col[np.abs(col) > 3]

54    -3.246492
674   -3.259759
Name: 2, dtype: float64

In [47]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
54   0.279953  0.916867 -3.246492  0.754386
287  3.147917  1.066797  1.285805  0.033555
303  0.228111  3.451387  0.971731 -1.231844
398  3.001277  0.719085  0.957576  1.755264
636  3.083284  0.164885  0.619286 -0.209004
674  1.082404 -0.361448 -3.259759 -0.144933
787  0.555912 -0.419080  0.579080 -3.008480
858  3.265581 -1.039675 -0.765193  1.089130
900  0.932900 -0.575699  2.289298  3.740591

In [48]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.011714    -0.003304    -0.026944    -0.077629
std       0.967357     0.978071     0.981737     0.994809
min      -2.964456    -2.870278    -3.000000    -3.000000
25%      -0.686696    -0.690528    -0.617242    -0.741641
50%      -0.000011    -0.042040    -0.037898    -0.042878
75%       0.650469     0.660259     0.614981     0.589848
max       3.000000     3.000000     2.724269     3.000000

In [49]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0 -1.0  1.0  1.0

In [50]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 1, 2, 0, 3])

In [51]:
df
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15

In [52]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [53]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
4    4
0    5
0    5
4    4
2   -1
1    7
0    5
3    6
1    7
dtype: int64

In [54]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [55]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [56]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [57]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [58]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [59]:
'::'.join(pieces)

'a::b::guido'

In [60]:
'guido' in val
val.index(',')
val.find(':')

-1

In [61]:
val.count(',')

2

In [62]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

In [63]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [64]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [65]:
regex.findall(text)

['    ', '\t ', '  \t']

In [66]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [67]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [68]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [69]:
print(regex.match(text))

None

In [70]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [71]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [72]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [73]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [74]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [75]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [76]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [77]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [78]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [79]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object